#+OPTIONS: tex:t 
#+include: R-text-common.org
#+Title: 4章 信頼区間の推定 Rの例題
#+property: header-args:R :session *rtext* :results output :exports both

* 平均パラメータの区間推定の問題

  「薬の投与により，血中のある物質の濃度が上昇し，健康状態が改善される」
  という。

  20人の患者への投与により，増加の程度 (%) の標本値が得られた:

#+begin_src R :results output :session *rtext* 
##
## 正規分布からの標本
##
### サイズ 20, 平均=29.2, 分散=1
###

(sample <- rnorm(20, mean=29.2, sd=1))

#+end_src

#+RESULTS:
:  [1] 27.94484 29.83686 27.79953 28.04755 28.75391 29.71464 28.29472 26.32046
:  [9] 30.47457 29.69439 28.47219 29.96765 29.69294 29.05225 30.87160 30.46751
: [17] 28.09111 29.15670 28.50214 27.93843

**** 危険度0.05, 信頼度0.95となる \(z^*\) 

     #+begin_src R :results output :session *rtext*
##
##  危険度・信頼度に対する z^* を求める
##

(zs <- qnorm(0.975)) ## 下側97.5%, 上側2.5% 点
pnorm(zs)  ## [-\infty, zs]となる確率

(zs <- qnorm(0.995)) ## 下側99.5%, 上側0.5% 点
pnorm(zs)  ## [-\infty, zs]となる確率

     #+end_src 

     #+RESULTS:
     : [1] 1.959964
     : [1] 0.975
     : [1] 2.575829
     : [1] 0.995

**** 標準正規分布で信頼度(1-\alpha)の信頼区間 (上記の説明通り)求める

      #+begin_src R :results output :session *rtext* 
## 
## 標準正規分布での信頼度(1-alpha)の信頼区間
z_interval <- function (alpha) {
  c(qnorm(1-alpha/2), qnorm(alpha/2))
  }

## 母平均の区間推定，分散既知
### alpha : 危険度， (1-alpha): 信頼度
### sample : 標本
### sigma2 : 母分散
est_conf_interval <- function (alpha, sample, sigma2) {
  xbar = mean(sample)
  n = length(sample)
  zs <- z_interval(0.05)
  sigma <- sqrt(sigma2)
  
  c(xbar - sigma*zs[1]/sqrt(n), xbar + sigma*zs[1]/sqrt(n))
}
var(sample)
z_interval(0.05)
est_conf_interval(0.05, sample, 1)

      #+end_src

      #+RESULTS:
      : [1] 0.7330411
      : [1]  1.959964 -1.959964
      : [1] 28.94026 29.81679

     
**** \( N\left(\overline{X}, \frac{\sigma^2}{n} \right) \) で信頼度(1-\alpha)の信頼区間を求める

 Rを用いれば，N(標本平均，sigma^2) の分布上での上下限座標を求めるのは簡
 単なので，標準化を行なわず，標本平均の正規分布上で直接計算でき:
     
      #+begin_src R :results output :session *rtext*

## N(標本平均，sigma^2) の分布上で求める
## 母平均の区間推定，分散既知
### alpha : 危険度， (1-alpha): 信頼度
### sample : 標本
### sigma2 : 母分散

est_conf_interval_2 <- function(alpha, sample, sigma2) {

  xbar = mean(sample)
  n = length(sample)
  zs_h =  qnorm(1-alpha/2, mean=xbar, sd=sqrt(sigma2/n))
  zs_l =  qnorm(alpha/2, mean=xbar, sd=sqrt(sigma2/n))
  c(zs_l, zs_h)
}

est_conf_interval_2(0.05, sample, 1)

      #+end_src

      #+RESULTS:
      : [1] 28.81210 29.68862

     
     
**** 危険度0.05, 信頼度0.95となる \(t^*_{n-1}\) 

     下記のRによる計算では，具体的は自由度の値が必要となる。
          
     #+begin_src R :results output :session *rtext* 
degree_of_free <- length(sample)-1
(tns <- qt(0.975,df=degree_of_free)) ## 下側97.5%, 上側2.5% 点
pt(tns,degree_of_free)  ## [-\infty, zs]となる確率

(tns <- qt(0.995, df=degree_of_free)) ## 下側99.5%, 上側0.5% 点
pt(tns, df=degree_of_free)  ## [-\infty, zs]となる確率

     #+end_src 

     #+RESULTS:
     : [1] 2.093024
     : [1] 0.975
     : [1] 2.860935
     : [1] 0.995

**** t_{n-1}分布で信頼度(1-alpha)の信頼区間 (上記の説明通り)求める

      #+begin_src R :results output :session *rtext* 
## 

## t-分布での信頼度(1-alpha)の信頼区間
t_interval <- function (alpha, sample) {
  c(qt(1-alpha/2,length(sample)-1), qt(alpha/2, length(sample)-1))
  }

## 母平均の区間推定，分散未知
### alpha : 危険度， (1-alpha): 信頼度
### sample : 標本
est_t_conf_interval <- function (alpha, sample) {
  xbar = mean(sample)
  s2   = var(sample)
  n = length(sample)
  ts <- t_interval(0.05, sample)
  sigma <- sqrt(s2)
  
  c(xbar - sigma*ts[1]/sqrt(n), xbar + sigma*ts[1]/sqrt(n))
}
mean(sample)
var(sample)
t_interval(0.05, sample)
est_t_conf_interval(0.05, sample)

      #+end_src

      #+RESULTS:
      : [1] 28.9547
      : [1] 1.295045
      : [1]  2.093024 -2.093024
      : [1] 28.4221 29.4873


*** \( \mu \) の信頼区間 (を求める公式) を求める
    
     \( 1-\alpha  =  P (|T_n| \leq z^{*}) \)
     
     \( =  P( \frac{|\overline{X_{(n)}}-\mu|}{\sqrt{S^2/n}} \leq
     z^{*}) \)
     
     \( =  P( {|\overline{X_{(n)}}-\mu|} \leq z^{*}\sqrt{S^2/n} ) \)
     
     \( =  P \left( \overline{X_{(n)}}-z^{*} \sqrt{S^2/n} \leq \mu
     \leq  \overline{X_{(n)}} + z^{*}\sqrt{S^2/n} \right) \)
     

     #+begin_src R :session *rtext* :results output :exports both :tangle Rtext/code/01.R

tz_interval <- function (alpha, sample) {
  c(qnorm(1-alpha/2), qnorm(alpha/2))
  }

## 母平均の区間推定，母分布未知

### alpha : 危険度， (1-alpha): 信頼度
### sample : 標本

est_tz_conf_interval <- function (alpha, sample) {

  xbar = mean(sample)
  s2   = var(sample)
  n = length(sample)
  tz <- tz_interval(0.05, sample)
  sigma <- sqrt(s2)
  
  c(xbar - sigma*tz[1]/sqrt(n), xbar + sigma*tz[1]/sqrt(n))

}

var(sample)
tz_interval(0.05, sample)
est_tz_conf_interval(0.05, sample)

      #+end_src

      #+RESULTS:
      : [1] 0.7330411
      : [1]  1.959964 -1.959964
      : [1] 29.00330 29.75376

** 95% 信頼区間の両端点

#+begin_src R :results output :session *rtext* 
###
### 
###
for (d in c(4,8,16,32,64)) {
  print(c(d), qchisq(0.025,df=d), qchisq(0.975,df=d)))
}
#+end_src

#+RESULTS:
: [1]  4.0000000  0.4844186 11.1432868
: [1]  8.000000  2.179731 17.534546
: [1] 16.000000  6.907664 28.845351
: [1] 32.00000 18.29076 49.48044
: [1] 64.00000 43.77595 88.00405


** 90% 信頼区間の両端点

#+begin_src R :results output :session *rtext* 
###
### 
###
for (d in c(4,8,16,32,64)) {
  print(c(d, qchisq(0.05,df=d), qchisq(0.95,df=d)))
}
#+end_src

#+RESULTS:
: [1] 4.000000 0.710723 9.487729
: [1]  8.000000  2.732637 15.507313
: [1] 16.000000  7.961646 26.296228
: [1] 32.00000 20.07191 46.19426
: [1] 64.00000 46.59491 83.67526
